tutorials/cases/canonical/radiation/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation       on;

heterogeneousRadiationModel  heterogeneousP1;

solverFreq 1;

heterogeneousAbsorptionEmissionModel heterogeneousConstantAbsorptionEmission;

heterogeneousConstantAbsorptionEmissionCoeffs
{
    a               a  [ 0 -1  0 0 0 0 0 ] 0;
    as              as [ 0 -1  0 0 0 0 0 ] 0;
    borderAs        borderAs [ 0 -1  0 0 0 0 0 ] 180;
    E               E  [ 1 -1 -3 0 0 0 0 ] 0.0;
    borderL         borderL  [ 0 1 0 0 0 0 0 ] 1.5e-3;
}

scatterModel    constantScatter;

sigma           sigma [ 0 -1 0 0 0 0 0 ] 1;
C               C [ 0 0 0 0 0 0 0 ] 1;

// ************************************************************************* //
