tutorials/cases/canonical/radiation/constant/reactions
species
(
    targas N2
);

reactions
(
);
